Revit 2024 API
Document.IsModelInCloud Property
 Identifies if document is stored on Autodesk cloud services.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019.1
Syntax
C#
public bool IsModelInCloud { get; }
Visual Basic
Public ReadOnly Property IsModelInCloud As Boolean
	Get
Visual C++
public:
property bool IsModelInCloud {
	bool get ();
}
See Also
Document Class
Autodesk.Revit.DB Namespace